
nc: 2  # number of classes
kpt_shape: [5, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales:
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C3Rep2N, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C3Rep2N, [256]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 3, C3Rep2N, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C3Rep2N, [1024]]  # 8

head:
  - [4, 1, Conv, [64, 1, 1]] # 9
  - [6, 1, Conv, [128, 1, 1]]  #10
  - [8, 1, Conv, [256, 1, 1]] #11
  - [9, 1, Conv, [64, 1, 1]]  #12
  - [10, 1, Conv, [128, 1, 1]]  #13
  - [11, 1, Conv, [256, 1, 1]]  #14
  - [[12, 13], 1, ASFF_2, [64, 0]]   # 15
  - [[12, 13], 1, ASFF_2, [128, 1]]  #16
  - [15, 1, CA, [64]]     #17
  - [16, 1, CA, [128]]     #18
  - [[17, 18, 14], 1, ASFF_3, [64, 0]]  #19
  - [[17, 18, 14], 1, ASFF_3, [128, 1]]  #20
  - [[17, 18, 14], 1, ASFF_3, [256, 2]] # 21
  - [19, 1, CA, [64]]  #22
  - [20, 1, CA, [128]] #23
  - [21, 1, CA, [256]] #24
  - [22, 1, Conv, [256, 1, 1]]  #25
  - [23, 1, Conv, [512, 1, 1]]   #26
  - [24, 1, Conv, [1024, 1, 1]]  #27
  - [[25, 26, 27], 1, Pose, [nc, kpt_shape]]  # Pose(P3, P4, P5)

